src/Documents/ДвижениеМногооборотнойТары/ДвижениеМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМногооборотнойТары</name>
  <basedOn>Document.МаршрутныйЛист</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыДвиженийМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПолучатель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузополучатели</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаВодителя</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/Базар_ВидыДвиженийМногооборотнойТары/Базар_ВидыДвиженийМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_ВидыДвиженийМногооборотнойТары</name>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
</mdclass:Enum>

src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаДоставка</registerRecords>
  <attributes>
    <name>ДокументЛогистики</name>
    <type>
      <types>DocumentRef.ТранспортнаяЛогистика</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РейсПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставыРейсов</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРейсе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресJSON</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Доверенность</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ea24046-be85-4b3a-a7fb-94daa9d5fd13">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e6796ec-3e70-4c2b-bfd3-734561cf90ee">
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f821e82b-1396-4cc3-b7e8-c44de00ea420">
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="38ae23fc-25c4-4c92-adaa-c82453712b32">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6b6b5a9-764c-4b57-9769-042ea6bf7581">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a91451d2-f8b3-4ea7-83e6-c95f5ae8d662">
    <name>ПодразделениеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="726ebb84-7974-4d9f-a2e6-33fbab82380d">
    <name>РучнаяКорректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73b5e625-ebb5-4178-8cc0-960843f75cea">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b6076129-af23-479c-86e9-e591eb40a244">
    <name>СпособЗачетаАвансов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="006e1000-e354-4c40-88f7-fdcb1897326b">
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aeb99934-f54a-4896-bffb-39f0a61b015c">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cb1302b9-3f01-48b0-8149-955656f1f5b1">
    <name>ТипЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0faa80a2-8a4b-4882-88bf-f343e422ab71">
      <name>ДоговорКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="396743c0-9652-4280-b8f2-b4c77cbed751">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5775cf55-4a2c-40bd-bfbc-567d71330811">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1a445c0b-4467-4e89-af38-298cab058550">
    <name>АгентскиеУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ff4e80f3-34f0-4240-bdea-aa0631fc0539">
      <name>ДоговорКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Маршруты/Маршруты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Маршруты</name>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокДвижения</name>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ДвижениеМногооборотнойТары/Forms/ФормаДокументаОбщая/Module.bsl
//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\+ОБЛАСТЬ+\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МногооборотнаяТараФормы.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеФормой(ЭтаФорма);
	
	ОбновитьНадписиНаФормеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриОткрытииНаСервере(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	
	МногооборотнаяТараФормы.ПриОткрытииНаСервере(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	Если НЕ ИспользуетсяНесколькоОрганизаций тогда
		Для Каждого Строка из Объект.НаВодителя цикл 
			Если Не ЗначениеЗаполнено(Строка.Организация) тогда
				Строка.Организация = Организация;
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка из Объект.Грузополучатели цикл 
			Если Не ЗначениеЗаполнено(Строка.Организация) тогда
				Строка.Организация = Организация;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МногооборотнаяТараФормы.ПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	МногооборотнаяТараФормы.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти
//----------------------------------область-------------------------------------


//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\+ОБЛАСТЬ+\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) тогда
		
		Оповещение = Новый ОписаниеОповещения(
			"ОбработкаОповещенияВопросПередЗаполнениемПоОснованию",
			ЭтотОбъект,
			Новый Структура("ДокументОснование", ВыбранноеЗначение)
		);
		
		ТекстВопроса = НСтр(
			"ru = 'Вы действительно хотите заполнить документ на основании " +
			ВыбранноеЗначение +
			"? Все данные текущего документа будут удалены, и заполнены на " + 
			"основании указанного Вами документа.'"
		);
		
		ЗаголовокДиалогаВопроса = "Заполнить документ на основании "+ВыбранноеЗначение+"?";
		
		ПоказатьВопрос(
			Оповещение,
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,
			30,
			КодВозвратаДиалога.Да,
			ЗаголовокДиалогаВопроса,
			КодВозвратаДиалога.Нет
		);
		
	Иначе
		
		ОчиститьДокументОснование();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	ДокументОснованиеОбработкаВыбора(Элемент, Неопределено, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораВодитель();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораАвтомобиль();
	
КонецПроцедуры

#КонецОбласти
//----------------------------------область-------------------------------------


//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\+ОБЛАСТЬ+\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
#Область ОбработчикиСобытийЭлементовТабличныхЧастейФормы

&НаКлиенте
Процедура ТабличнаяЧастьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока тогда
		Если НЕ ИспользуетсяНесколькоОрганизаций тогда
			Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") тогда
				Элемент.ТекущиеДанные.Организация = Организация;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриИзменении(Элемент)
	
	ОбновитьНадписиНаФормеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучателиДокументПриИзменении(Элемент)
	
	Элементы.Грузополучатели.ТекущиеДанные.Организация         = Элементы.Грузополучатели.ТекущиеДанные.Документ.Организация;
	Если ЗначениеЗаполнено(Элементы.Грузополучатели.ТекущиеДанные.Документ.Грузополучатель) тогда
		Элементы.Грузополучатели.ТекущиеДанные.Грузополучатель = Элементы.Грузополучатели.ТекущиеДанные.Документ.Грузополучатель;
	Иначе
		Элементы.Грузополучатели.ТекущиеДанные.Грузополучатель = Элементы.Грузополучатели.ТекущиеДанные.Документ.Контрагент;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
//----------------------------------область-------------------------------------


//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\+ОБЛАСТЬ+\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ИмяПоля = НСтр("ru = 'Документ-основание'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, ИмяПоля);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ДокументОснование");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуНаСервере(Команда.Имя);
	
	ОбновитьНадписиНаФормеНаСервере();
	
КонецПроцедуры

#КонецОбласти
//----------------------------------область-------------------------------------


//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\+ОБЛАСТЬ+\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
#Область ПроцедурыИФункцииУправленияФормой

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ВидимостьДокументОснование         = Истина;
	ВидимостьПоставщик                 = Истина;
	ВидимостьМаршрут                   = Истина;
	ВидимостьВодитель                  = Истина;
	ВидимостьАвтомобиль                = Истина;
	ВидимостьВодительПолучатель        = Истина;
	ВидимостьЗаполнитьТЧ               = Истина;
	ВидимостьТЧНаВодителя              = Истина;
	ВидимостьТЧГрузополучатели         = Истина;
	ВидимостьТЧГрузополучателиДокумент = Истина;
	
	ТолькоПросмотрМаршрут              = Ложь;
	ТолькоПросмотрВодитель             = Ложь;
	ТолькоПросмотрАвтомобиль           = Ложь;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Передача") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Прием") Тогда
		
		ВидимостьПоставщик = Ложь;
		
		Если ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			ВидимостьВодительПолучатель = Ложь;
			ТолькоПросмотрМаршрут       = Истина;
			ТолькоПросмотрВодитель      = Истина;
			ТолькоПросмотрАвтомобиль    = Истина;
		Иначе
			ВидимостьЗаполнитьТЧ        = Ложь;
			ВидимостьМаршрут            = Ложь;
			ВидимостьВодительПолучатель = Ложь;
		КонецЕсли;
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Прием") тогда
			ВидимостьТЧГрузополучателиДокумент = Ложь;
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Перемещение") тогда
		
		ВидимостьЗаполнитьТЧ        = Ложь;
		ВидимостьПоставщик          = Ложь;
		ВидимостьМаршрут            = Ложь;
		ВидимостьАвтомобиль         = Ложь;
		ВидимостьТЧГрузополучатели  = Ложь;
		ВидимостьДокументОснование  = Ложь;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику") тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			ВидимостьЗаполнитьТЧ    = Ложь;
		КонецЕсли;
		
		ВидимостьТЧГрузополучатели  = Ложь;
		ВидимостьМаршрут            = Ложь;
		ВидимостьАвтомобиль         = Ложь;
		ВидимостьВодитель           = Ложь;
		ВидимостьВодительПолучатель = Ложь;
		
	КонецЕсли;
	
	Элементы.ДокументОснование.Видимость        = ВидимостьДокументОснование;
	Элементы.Поставщик.Видимость                = ВидимостьПоставщик;
	Элементы.Маршрут.Видимость                  = ВидимостьМаршрут;
	Элементы.Водитель.Видимость                 = ВидимостьВодитель;
	Элементы.Автомобиль.Видимость               = ВидимостьАвтомобиль;
	Элементы.ВодительПолучатель.Видимость       = ВидимостьВодительПолучатель;
	Элементы.ГруппаНаВодителя.Видимость         = ВидимостьТЧНаВодителя;
	Элементы.ГруппаГрузополучатели.Видимость    = ВидимостьТЧГрузополучатели;
	Элементы.НаВодителяЗаполнить.Видимость      = ВидимостьЗаполнитьТЧ;
	Элементы.ГрузополучателиЗаполнить.Видимость = ВидимостьЗаполнитьТЧ;
	Элементы.ГрузополучателиДокумент.Видимость  = ВидимостьТЧГрузополучателиДокумент;
	
	Элементы.Маршрут.ТолькоПросмотр             = ТолькоПросмотрМаршрут;
	Элементы.Водитель.ТолькоПросмотр            = ТолькоПросмотрВодитель;
	Элементы.Автомобиль.ТолькоПросмотр          = ТолькоПросмотрАвтомобиль;
	
	Элементы.Страницы.ОтображениеСтраниц        = ?(ВидимостьТЧГрузополучатели, ОтображениеСтраницФормы.ЗакладкиСверху, ОтображениеСтраницФормы.Нет);
	
	Элементы.НаВодителя.АвтоОтметкаНезаполненного      = Ложь;
	Элементы.Грузополучатели.АвтоОтметкаНезаполненного = Ложь;
	Если ВидимостьТЧГрузополучатели тогда
		Если Объект.НаВодителя.Количество() = 0 И Объект.Грузополучатели.Количество() = 0 тогда
			Элементы.НаВодителя.АвтоОтметкаНезаполненного      = Истина;
			Элементы.Грузополучатели.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
	Иначе
		Элементы.НаВодителя.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписиНаФормеНаСервере() Экспорт
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Передача") Тогда
		Элементы.Водитель.Заголовок = "Водитель";
		Элементы.ГруппаНаВодителя.Заголовок = "Передача водителю";
		Элементы.ГруппаГрузополучатели.Заголовок = "Передача грузополучателю";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Прием") Тогда
		Элементы.Водитель.Заголовок = "Водитель";
		Элементы.ГруппаНаВодителя.Заголовок = "Прием от водителя";
		Элементы.ГруппаГрузополучатели.Заголовок = "Прием от грузополучателя";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Перемещение") Тогда
		Элементы.Водитель.Заголовок = "Водитель-отправитель";
		Элементы.ГруппаНаВодителя.Заголовок = "Перемещение тары";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику") Тогда
		Элементы.ГруппаНаВодителя.Заголовок = "Возврат тары";
	КонецЕсли;
	
	Если Объект.Грузополучатели.Количество() > 0 тогда
		Элементы.ГруппаГрузополучатели.Заголовок = Элементы.ГруппаГрузополучатели.Заголовок + " ("+Объект.Грузополучатели.Количество()+")";
	КонецЕсли;
	
	Если Объект.НаВодителя.Количество() > 0 тогда
		Элементы.ГруппаНаВодителя.Заголовок = Элементы.ГруппаНаВодителя.Заголовок + " ("+Объект.НаВодителя.Количество()+")";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
//----------------------------------область-------------------------------------


//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\+ОБЛАСТЬ+\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
#Область ПроцедурыИФункцииСлужебные
// Процедуры и функции которые используют другие области и общие модули.

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьПараметрыВыбораВодитель()
	
	Элементы.Водитель.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
	
	Если ЗначениеЗаполнено(Объект.Автомобиль) тогда
		ПараметрыВыбораВодитель = Новый Массив();
		ПараметрыВыбораВодитель.Добавить(Новый ПараметрВыбора("Отбор.Перевозчик", Объект.Автомобиль.Перевозчик));
		
		НовыеПараметрыВыбораВодитель = Новый ФиксированныйМассив(ПараметрыВыбораВодитель);
		
		Элементы.Водитель.ПараметрыВыбора = НовыеПараметрыВыбораВодитель;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораАвтомобиль()
	
	Элементы.Автомобиль.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
	
	Если ЗначениеЗаполнено(Объект.Водитель) тогда
		ПараметрыВыбораАвтомобиль = Новый Массив();
		ПараметрыВыбораАвтомобиль.Добавить(Новый ПараметрВыбора("Отбор.Перевозчик", Объект.Водитель.Перевозчик));
		
		НовыеПараметрыВыбораАвтомобиль = Новый ФиксированныйМассив(ПараметрыВыбораАвтомобиль);
		
		Элементы.Автомобиль.ПараметрыВыбора  = НовыеПараметрыВыбораАвтомобиль;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере(ИмяКоманды)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ИмяКоманды = "ЗаполнитьТаблицуНаВодителя" тогда
		ДокументОбъект.ЗаполнитьТабличныеЧасти(Истина, Ложь);
	ИначеЕсли ИмяКоманды = "ЗаполнитьТаблицуГрузополучатели" тогда
		ДокументОбъект.ЗаполнитьТабличныеЧасти(Ложь, Истина);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаОсновании()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, Объект.ДокументОснование);
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.МаршрутныйЛист") тогда
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Объект.ДокументОснование, "Дата, Маршрут, Автомобиль, Водитель");
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
		ДокументОбъект.Поставщик = Объект.ДокументОснование.Контрагент;
	КонецЕсли;
	
	ФиксированноеВремяДокументов.УстановитьВремяНовогоДокумента(ДокументОбъект, Ложь);
	ДокументОбъект.ЗаполнитьТабличныеЧасти();
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Модифицированность = Истина;
	
	ОбновитьНадписиНаФормеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокументОснование()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Передача")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Прием") Тогда
		Объект.Поставщик          = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Объект.ВодительПолучатель = ПредопределенноеЗначение("Справочник.Водители.ПустаяСсылка");
		Объект.ДокументОснование  = ПредопределенноеЗначение("Документ.МаршрутныйЛист.ПустаяСсылка");
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Перемещение") Тогда
		Объект.Поставщик          = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Объект.ДокументОснование  = ПредопределенноеЗначение("Документ.МаршрутныйЛист.ПустаяСсылка");
		Объект.Грузополучатели.Очистить();
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику") Тогда
		Объект.Маршрут            = ПредопределенноеЗначение("Справочник.Маршруты.ПустаяСсылка");
		Объект.Автомобиль         = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
		Объект.Водитель           = ПредопределенноеЗначение("Справочник.Водители.ПустаяСсылка");
		Объект.ВодительПолучатель = ПредопределенноеЗначение("Справочник.Водители.ПустаяСсылка");
		Объект.ДокументОснование  = ПредопределенноеЗначение("Документ.ПоступлениеТоваровУслуг.ПустаяСсылка");
		Объект.Грузополучатели.Очистить();
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
	УправлениеФормой(ЭтаФорма);
	ОбновитьНадписиНаФормеНаСервере();
	
КонецПроцедуры

#КонецОбласти
//----------------------------------область-------------------------------------


//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\+ОБЛАСТЬ+\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/
#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОбработкаОповещенияВопросПередЗаполнениемПоОснованию(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДокументОснование = ДополнительныеПараметры.ДокументОснование;
	
	ЗаполнитьДокументНаОсновании();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
//----------------------------------область-------------------------------------
